## Problem 1

### Import the libraries

### Import արեք pandas գրադարանը pd անունով։

In [5]:
import pandas as pd

### Open the dataset gender.txt, assign to a variable gender and use user_id as index

### Պահեք gender.txt-ի պարունակությունը  gender փոփոխականում ու օգտագործեք  user_id-ն որպես dataframe-ի index։

In [6]:
gender=pd.read_csv('data/gender.txt',sep='|', index_col = 'user_id')

### Print the first 20 entries

### Տպեք առաջին 20 տողերը։

In [7]:
gender[:20:]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660

### Print the last 10 entries

### Տպեք վերջին 10 տողերը։

In [8]:
gender[-10::]

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### What is the number of rows in the dataset?

### Քանի տող կա dataset-ում?

In [9]:
len(gender)

943

### What is the number of columns in the dataset?

### Քանի սյուն կա dataset-ում?

In [10]:
len(gender.columns)

4

### Print the name of all the columns

### Տպեք սյուների անունները։

In [11]:
print(list(gender.columns))

['age', 'gender', 'occupation', 'zip_code']

### How is the dataset indexed?

### Ինչպեք է ինդեքսավորված dataset-ը?

In [12]:
gender.index.name

'user_id'

### What is the data type of each column?

### Ինչ տիպի արժեքներ են պահվում յուրաքանչյուր սյան մեջ?

In [45]:
for i in gender.columns:
    print(type(gender.loc[::,i][1]))

<class 'numpy.int64'>
<class 'str'>
<class 'str'>
<class 'str'>

### Print only the occupation column

### Տպեք occupation սյունը։

In [72]:
gender["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
6          executive
7      administrator
8      administrator
9            student
10            lawyer
11             other
12             other
13          educator
14         scientist
15          educator
16     entertainment
17        programmer
18             other
19         librarian
20         homemaker
21            writer
22            writer
23            artist
24            artist
25          engineer
26          engineer
27         librarian
28            writer
29        programmer
30           student
           ...
914            other
915    entertainment
916         engineer
917          student
918        scientist
919            other
920           artist
921          student
922    administrator
923          student
924            other
925         salesman
926    entertainment
927       programmer
928          student
929        scientist
930        scientist
931         educator
932         educator
933          student
934         engineer
935           doctor
936            other
937         educator
938       technician
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### How many different occupations there are in this dataset?

### Քանի տարբեր արժեքներ են պահվում occupation սյան մեջ?

In [79]:
len(gender['occupation'].value_counts())

21

### * What is the most frequent occupation?

### * Որն է occupation սյան մեջ ավելի հաճախ հանդիպող արժեքը?

In [92]:
gender['occupation'].value_counts().index[0]

'student'